#include <iostream>

using namespace std;

int main(int argc, char** argv) {

int t[3][3],p[7][7];
int i=0,j=0,u=0,z=0,r=0;

//t[0][0]=1;t[0][1]=1;t[0][2]=1;t[1][0]=1;t[1][1]=0;t[1][2]=1;t[2][0]=1;t[2][1]=1;t[2][2]=0;

// p[0][0]=1;p[0][1]=1;p[0][2]=0;p[0][3]=0;p[0][4]=0;p[0][5]=0;p[0][6]=0;
// p[1][0]=0;p[1][1]=0;p[1][2]=0;p[1][3]=1;p[1][4]=1;p[1][5]=1;p[1][6]=0;
// p[2][0]=0;p[2][1]=0;p[2][2]=0;p[2][3]=1;p[2][4]=0;p[2][5]=1;p[2][6]=0;
// p[3][0]=1;p[3][1]=1;p[3][2]=0;p[3][3]=1;p[3][4]=1;p[3][5]=0;p[3][6]=0;
// p[4][0]=0;p[4][1]=0;p[4][2]=0;p[4][3]=0;p[4][4]=0;p[4][5]=0;p[4][6]=0;
// p[5][0]=0;p[5][1]=0;p[5][2]=0;p[5][3]=0;p[5][4]=0;p[5][5]=0;p[5][6]=0;
// p[6][0]=0;p[6][1]=0;p[6][2]=0;p[6][3]=0;p[6][4]=0;p[6][5]=0;p[6][6]=0;

//input the value of the 2-dimensions array
 cin>>t[0][0]>>t[0][1]>>t[0][2];cout<<endl;

 cin>>t[1][0]>>t[1][1]>>t[1][2];cout<<endl;

 cin>>t[2][0]>>t[2][1]>>t[2][2];cout<<endl;

 cin>>p[0][0]>>p[0][1]>>p[0][2]>>p[0][3]>>p[0][4]>>p[0][5]>>p[0][6];cout<<endl;

 cin>>p[1][0]>>p[1][1]>>p[1][2]>>p[1][3]>>p[1][4]>>p[1][5]>>p[1][6];cout<<endl;

 cin>>p[2][0]>>p[2][1]>>p[2][2]>>p[2][3]>>p[2][4]>>p[2][5]>>p[2][6];cout<<endl;

 cin>>p[3][0]>>p[3][1]>>p[3][2]>>p[3][3]>>p[3][4]>>p[3][5]>>p[3][6];cout<<endl;

 cin>>p[4][0]>>p[4][1]>>p[4][2]>>p[4][3]>>p[4][4]>>p[4][5]>>p[4][6];cout<<endl;

 cin>>p[5][0]>>p[5][1]>>p[5][2]>>p[5][3]>>p[5][4]>>p[5][5]>>p[5][6];cout<<endl;

 cin>>p[6][0]>>p[6][1]>>p[6][2]>>p[6][3]>>p[6][4]>>p[6][5]>>p[6][6];cout<<endl;

for(u=0;u<5;u++){
    for(z=0;z<5;z++){
        r=0;
        for(i=0;i<3;i++){
            for(j=0;j<3;j++){
                if(t[i][j]!=p[u+i][z+j]){
                    r=2;
                    break;
                }//end of if
            }//end of for controlling j
            if(t[i][j-1]!=p[u+i][z+j-1]){
                r=2;
                break;
            }//end of if
        }/*
        end of for controlling i
        整個for是用來判斷模板以及來源是否相同，如果其一元素不相同就會先從內圈for 
        跳出再跳出外面的for迴圈 並且使此事件的代表數字為2（r）
        */
       if(r==0){
           break;
           /*
           r==0代表裡面的元素皆吻合不需再將比較換列及行
           (因為如果有元素不相符合r會變成2）
           先跳出控制行的迴圈（控制z）
           */
        }//end of if
    }//end of for loop controlling z
    if(r==0){
        cout<<u<<","<<z<<endl;
        break;//r==0代表裡面的元素皆吻合不需再將比較換列及行，再跳出控制行的迴圈（控制u）
    }//end of if
}//end of for loop controlling u


return 0;
}